<a href="https://colab.research.google.com/github/Tapas-ranjan/DATA-ENGINEERING-/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as nm

In [4]:
GLOBAL_DATA = {
     'Customer_Name':['Alex','John','Mathew','Matt','Jacob'],
     'Customer_id':[123457,123458,123459,12345,1256],
     'Open_date':['20101012','20101012','20101012','20101012','20101012',], 
     'Last_Consulated_Date':['20121013','20121013','20121013','20121013','20121013',], 
     'Vaccination_id':['MVD','MVD','MVD','MVD','MVD',], 
     'Dr_name CHAR':['Paul','Paul','Paul','Paul','Paul',],
     'State':['SA','TN','WAS','BOS','VIS'],
     'Country':['USA','IND','PHIL','NYC','AU'],
     'Post_code':['06031987','06031987','06031987','06031987','06031987',],
     'Active_customer':['A','A','A','A','A'] 
}
df = pd.DataFrame(GLOBAL_DATA)
df

  Customer_Name  Customer_id Open_date  ... Country Post_code Active_customer
0          Alex       123457  20101012  ...     USA  06031987               A
1          John       123458  20101012  ...     IND  06031987               A
2        Mathew       123459  20101012  ...    PHIL  06031987               A
3          Matt        12345  20101012  ...     NYC  06031987               A
4         Jacob         1256  20101012  ...      AU  06031987               A

[5 rows x 10 columns]